iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32L4xx/emptyTargetInit/stm32l4_sfr.h
};

#define NVIC (*(volatile struct NVIC_tag *) 0xe000e100)

struct CRS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOKIE:1;
      uint64_t SYNCWARNIE:1;
      uint64_t ERRIE:1;
      uint64_t ESYNCIE:1;
      uint64_t reservedSpace0:1;
      uint64_t CEN:1;
      uint64_t AUTOTRIMEN:1;
      uint64_t SWSYNC:1;
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:16;
      uint64_t FELIM:8;
      uint64_t SYNCDIV:3;
      uint64_t reservedSpace0:1;
      uint64_t SYNCSRC:2;
      uint64_t reservedSpace1:1;
      uint64_t SYNCPOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOKF:1;
      uint64_t SYNCWARNF:1;
      uint64_t ERRF:1;
      uint64_t ESYNCF:1;
      uint64_t reservedSpace0:4;
      uint64_t SYNCERR:1;
      uint64_t SYNCMISS:1;
      uint64_t TRIMOVF:1;
      uint64_t reservedSpace1:4;
      uint64_t FEDIR:1;
      uint64_t FECAP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCOKC:1;
      uint64_t SYNCWARNC:1;
      uint64_t ERRC:1;
      uint64_t ESYNCC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

};

#define CRS (*(volatile struct CRS_tag *) 0x40006000)

struct DCMI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE:1;
      uint64_t CM:1;
      uint64_t CROP:1;
      uint64_t JPEG:1;
      uint64_t ESS:1;
      uint64_t PCKPOL:1;
      uint64_t HSPOL:1;
      uint64_t VSPOL:1;
      uint64_t FCRC:2;
      uint64_t EDM:2;
      uint64_t reservedSpace0:2;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t BSM:2;
      uint64_t OEBS:1;
      uint64_t LSM:1;
      uint64_t OELS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSYNC:1;
      uint64_t VSYNC:1;
      uint64_t FNE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_RIS:1;
      uint64_t OVR_RIS:1;
      uint64_t ERR_RIS:1;
      uint64_t VSYNC_RIS:1;
      uint64_t LINE_RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_IE:1;
      uint64_t OVR_IE:1;
      uint64_t ERR_IE:1;
      uint64_t VSYNC_IE:1;
      uint64_t LINE_IE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_MIS:1;
      uint64_t OVR_MIS:1;
      uint64_t ERR_MIS:1;
      uint64_t VSYNC_MIS:1;
      uint64_t LINE_MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_ISC:1;
      uint64_t OVR_ISC:1;
      uint64_t ERR_ISC:1;
      uint64_t VSYNC_ISC:1;
      uint64_t LINE_ISC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSC:8;
      uint64_t LSC:8;
      uint64_t LEC:8;
      uint64_t FEC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSU:8;
      uint64_t LSU:8;
      uint64_t LEU:8;
      uint64_t FEU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HOFFCNT:14;
      uint64_t reservedSpace0:2;
      uint64_t VST:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSTRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCNT:14;
      uint64_t reservedSpace0:2;
      uint64_t VLINE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CWSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Byte0:8;
      uint64_t Byte1:8;
      uint64_t Byte2:8;
      uint64_t Byte3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

};

#define DCMI (*(volatile struct DCMI_tag *) 0x50050000)

struct HASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INIT:1;
      uint64_t DMAE:1;
      uint64_t DATATYPE:2;
      uint64_t MODE:1;
      uint64_t ALGO0:1;
      uint64_t NBW:4;
      uint64_t DINNE:1;
      uint64_t MDMAT:1;
      uint64_t reservedSpace1:2;
      uint64_t LKEY:1;
      uint64_t reservedSpace2:1;
      uint64_t ALGO1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBLW:5;
      uint64_t reservedSpace0:3;
      uint64_t DCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR0;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIE:1;
      uint64_t DCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DINIS:1;
      uint64_t DCIS:1;
      uint64_t DMAS:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res1[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR16:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR17:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR18:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR19:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR20:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR21:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR22:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR23:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR24:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR25:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR26:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR27:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR28:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR29:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR30:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR33:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR34:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR35:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR36:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR37:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR38:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR39:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR40:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR41:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR42:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR43:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR44:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR45:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR46:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR47:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR48:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR49:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR50:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR51:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR52:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR53:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR53;

  uint8_t res2[320];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t H7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_HR7;

